console.log('---------------------------------------------func1---------------------------------------------')
func1 = () => {
    for (let i = 20; i <= 30; i += .5) {
        console.log('i = ' + i)
    }
}
func1()

console.log('---------------------------------------------func2---------------------------------------------')
func2 = (usdPrice) => {
    for (let i = 10; i <= 100; i += 10) {
        console.log(i * usdPrice)
    }
}
func2(27)

console.log('---------------------------------------------func3---------------------------------------------')
func3 = () => {
    for (let i = 1; i <= 100; i++) {
        console.log(i * i <= 100 ? `i = ${i} ${i * i}` : i = false)
        if (i === false) return   //убираем лишние итерации
    }
}

func3()

console.log('---------------------------------------------func4---------------------------------------------')
func4 = (num) => {
    for (let i = 2; i <= num; i++) {
        if (num % i === 0) {
            if (i < num) {
                return;
            } else console.log(i)
        }
    }
}

func4(5)

console.log('---------------------------------------------func5---------------------------------------------')
func5 = (num) => {
    num % 3 === 0 ? console.log('можно') : console.log('нельзя')
}

func5(81)